tap "cjbassi/ytop"
tap "homebrew/bundle"
tap "thezoraiz/ascii-image-converter"
brew "xz"
brew "aria2"
brew "asdf"
brew "python@3.13"
brew "autojump"
brew "aws-vault"
brew "awscli"
brew "bash"
brew "bat"
brew "ccls"
brew "circleci"
brew "clipboard"
brew "cmake"
brew "colima"
brew "curl"
brew "composer"
brew "diffr"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "gnu-sed"
brew "gpatch"
brew "htop"
brew "libomp"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "lazygit"
brew "node"
brew "leapp-cli"
brew "lolcat"
brew "lsd"
brew "lua-language-server"
brew "luarocks"
brew "mysql"
brew "neovim"
brew "neovim-remote"
brew "parallel"
brew "php@8.1", link: true
brew "poetry"
brew "pwgen"
brew "rich-cli"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "stylua"
brew "tealdeer"
brew "thefuck"
brew "unar"
brew "vim"
brew "wget"
brew "xclip"
brew "xsel"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-navigation-tools"
brew "zsh-syntax-highlighting"
brew "zsh-system-clipboard"
brew "cjbassi/ytop/ytop"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
cask "amethyst"
cask "crystalfetch"
cask "cursor"
cask "finch"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "fork"
cask "google-cloud-sdk"
cask "iterm2"
cask "kitty"
cask "leapp"
cask "libreoffice"
cask "maccy"
cask "masscode"
cask "meld"
cask "multipass"
cask "mysqlworkbench"
cask "phpstorm"
cask "pycharm"
cask "sourcetree"
cask "tableplus"
cask "tunnelblick"
cask "utm"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "batisteo.vscode-django"
vscode "bmewburn.vscode-intelephense-client"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "xdebug.php-debug"
vscode "zobo.php-intellisense"
